DataProcessors/УправлениеКадровымРезервом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>УправлениеКадровымРезервом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ИсключениеИзКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИсключениеИзКадровогоРезерва</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеИсключенияИзКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗавершитьНаставничество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументОснованиеНаставничество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВключениеВКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВключениеВКадровыйРезерв</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВключениеВКадровыйРезерв</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВключенияВКадровыйРезерв</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусГотовности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзменениеСтатусаГотовностиРезервистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеСтатусаГотовностиРезервистов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/УправлениеКадровымРезервом/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды") Тогда
		МодульГрейды = ОбщегоНазначения.ОбщийМодуль("Грейды");
		МодульГрейды.НастроитьОтображениеГрейдаВФормеСписка(ЭтотОбъект, "ВТКадровыйРезерв", "КлючевыеДолжности",
			"ПозицияШтатногоРасписания");
	КонецЕсли;
	
	ИспользуетсяКадровыйРезервПоВидам = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам");
	ИспользуютсяЗаявкиНаВключениеВРезерв = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВключениеВКадровыйРезерв");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ПриСозданииФормыУправлениеКадровымРезервом(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьВидимостьДинамическихСписков();
	УстановитьВидимостьСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ТекущиеДанные = Элементы.КлючевыеДолжности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписанаПозицияКадровогоРезерва"
		Или ИмяСобытия = "ЗаписаноИсключениеИзКадровогоРезерва"
		Или ИмяСобытия = "ЗаписанаЗаявкаНаВключениеВКадровыйРезерв"
		Или ИмяСобытия = "ЗаписаноВключениеВКадровыйРезерв"
		Или ИмяСобытия = "ЗаписаноИзменениеСтатусаГотовностиРезервистов" Тогда
		Элементы.КлючевыеДолжности.Обновить();
		ВывестиИнформациюОКадровомРезерве();
	ИначеЕсли ИмяСобытия = "ИспользоватьЗаявкиНаВключениеВКадровыйРезервИзменение" Тогда
		УстановитьВидимостьСтраниц();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументРезервистыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка,
	ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Действие = "ОткрытьКарточкуСотрудника" Тогда
		ОткрытьКарточкуРезервиста(Расшифровка.ФизическоеЛицо);
	ИначеЕсли Расшифровка.Действие = "ИсключитьИзРезерва" Тогда
		ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, Подразделение", Расшифровка.ФизическоеЛицо,
			Расшифровка.Подразделение);
		ОткрытьФорму("Документ.ИсключениеИзКадровогоРезерва.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ОткрытьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("Ключ",
			Расшифровка.ПозицияКадровогоРезерва));
	ИначеЕсли Расшифровка.Действие = "СоздатьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("ПозицияШтатногоРасписания",
			Расшифровка.ПозицияШтатногоРасписания));
	ИначеЕсли Расшифровка.Действие = "ВключитьВРезерв" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПозицияРезерва", Расшифровка.ПозицияКадровогоРезерва);
		ПараметрыФормы.Вставить("Подразделение", Расшифровка.Подразделение);
		Если Расшифровка.Свойство("ВидРезерва") Тогда
			ПараметрыФормы.Вставить("ВидРезерва", Расшифровка.ВидРезерва);
		КонецЕсли;
		ОткрытьФорму("Документ.ВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ОткрытьРезультатыЭкспертнойОценки" Тогда
		ВариантОтчета = "ИндивидуальнаяОценка";
		ПользовательскиеНастройкиОтчета = ПользовательскиеНастройкиОтчетаЭкспертнойОценки(
			Новый Структура("ОпросПоКомпетенциям,ФизическоеЛицо,КлючВарианта", Расшифровка.ОпросПоКомпетенциям,
			Расшифровка.ФизическоеЛицо, ВариантОтчета));
		ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, КлючВарианта, ПользовательскиеНастройки",
			Истина, ВариантОтчета, ПользовательскиеНастройкиОтчета);
		ОткрытьФорму("Отчет.РезультатыОпросовПоКомпетенциям.Форма", ПараметрыОтчета);
	ИначеЕсли Расшифровка.Действие = "СоздатьИПР" Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура());
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Владелец", Расшифровка.УчастникКадровогоРезерва);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Основание", Расшифровка.ПозицияКадровогоРезерва);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Подразделение", Расшифровка.Подразделение);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Наставник", Расшифровка.Наставник);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Куратор", Расшифровка.Куратор);
		ОткрытьФорму("Справочник.ИндивидуальныйПланРазвития.ФормаОбъекта",
			ПараметрыФормы, ЭтотОбъект, Расшифровка.УчастникКадровогоРезерва);
	ИначеЕсли Расшифровка.Действие = "ОткрытьИПР" Тогда
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка.ИндивидуальныйПланРазвития);
		ОткрытьФорму("Справочник.ИндивидуальныйПланРазвития.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли Расшифровка.Действие = "ИзменитьСтатус" Тогда
		ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, Подразделение", Расшифровка.ФизическоеЛицо,
			Расшифровка.Подразделение);
		ОткрытьФорму("Документ.ИзменениеСтатусаГотовностиРезервистов.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингОднаЗвезда" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 1);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингДвеЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 2);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингТриЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 3);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингЧетыреЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 4);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингПятьЗвезд" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 5);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументСотрудникиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Действие = "ОткрытьКарточкуСотрудника" Тогда
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", Новый Структура("Ключ", Расшифровка.ФизическоеЛицо));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументКандидатыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Действие = "ОткрытьКарточкуСотрудника" Тогда
		ОткрытьКарточкуРезервиста(Расшифровка.ФизическоеЛицо);
	ИначеЕсли Расшифровка.Действие = "СоздатьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("ПозицияШтатногоРасписания",
			Расшифровка.ПозицияШтатногоРасписания));
	ИначеЕсли Расшифровка.Действие = "ОткрытьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("Ключ", Расшифровка.ПозицияКадровогоРезерва));
	ИначеЕсли Расшифровка.Действие = "ДобавитьКандидата" Тогда
		ПараметрыФормы = Новый Структура("ПозицияРезерва, ВидРезерва", Расшифровка.ПозицияКадровогоРезерва,
			Расшифровка.ВидРезерва);
		ОткрытьФорму("Документ.ЗаявкаНаВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ИсключитьКандидата" Тогда
		ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, Подразделение", Расшифровка.ФизическоеЛицо,
			Расшифровка.Подразделение);
		ОткрытьФорму("Документ.ИсключениеИзКадровогоРезерва.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ВключитьКандидата" Тогда
		ПараметрыФормы = Новый Структура("Подразделение, ПозицияРезерва, УчастникКадровогоРезерва");
		ПараметрыФормы.Подразделение = Расшифровка.Подразделение;
		ПараметрыФормы.ПозицияРезерва = Расшифровка.ПозицияКадровогоРезерва;
		ПараметрыФормы.УчастникКадровогоРезерва = Расшифровка.ФизическоеЛицо;
		Если Расшифровка.Свойство("ВидРезерва") Тогда
			ПараметрыФормы.Вставить("ВидРезерва", Расшифровка.ВидРезерва);
		КонецЕсли;
		ОткрытьФорму("Документ.ВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ОткрытьРезультатыЭкспертнойОценки" Тогда
		ВариантОтчета = "ИндивидуальнаяОценка";
		ПользовательскиеНастройкиОтчета = ПользовательскиеНастройкиОтчетаЭкспертнойОценки(
			Новый Структура("ОпросПоКомпетенциям,ФизическоеЛицо,КлючВарианта", Расшифровка.ОпросПоКомпетенциям,
			Расшифровка.ФизическоеЛицо, ВариантОтчета));
		ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, КлючВарианта, ПользовательскиеНастройки",
			Истина, ВариантОтчета, ПользовательскиеНастройкиОтчета);
		ОткрытьФорму("Отчет.РезультатыОпросовПоКомпетенциям.Форма", ПараметрыОтчета);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингОднаЗвезда" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 1);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингДвеЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 2);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингТриЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 3);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингЧетыреЗвезды" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 4);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	ИначеЕсли Расшифровка.Действие = "УстановитьРейтингПятьЗвезд" Тогда
		ПоставитьРейтингНаСервере(Расшифровка.ПозицияКадровогоРезерва, Расшифровка.ФизическоеЛицо, 5);
		ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПотенциальныеРезервистыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка,
	ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Действие = "ОткрытьКарточкуСотрудника" Тогда
		ОткрытьКарточкуРезервиста(Расшифровка.ФизическоеЛицо);
	ИначеЕсли Расшифровка.Действие = "СоздатьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("ПозицияШтатногоРасписания",
			Расшифровка.ПозицияШтатногоРасписания));
	ИначеЕсли Расшифровка.Действие = "ОткрытьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("Ключ",
			Расшифровка.ПозицияКадровогоРезерва));
	ИначеЕсли Расшифровка.Действие = "ОткрытьРезультатыЭкспертнойОценки" Тогда
		ВариантОтчета = "ИндивидуальнаяОценка";
		ПользовательскиеНастройкиОтчета = ПользовательскиеНастройкиОтчетаЭкспертнойОценки(
			Новый Структура("ОпросПоКомпетенциям,ФизическоеЛицо,КлючВарианта", Расшифровка.ОпросПоКомпетенциям,
				Расшифровка.ФизическоеЛицо, ВариантОтчета));
		ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, КлючВарианта, ПользовательскиеНастройки",
			Истина, ВариантОтчета, ПользовательскиеНастройкиОтчета);
		ОткрытьФорму("Отчет.РезультатыОпросовПоКомпетенциям.Форма", ПараметрыОтчета);
	ИначеЕсли Расшифровка.Действие = "ВключитьВРезерв" Тогда
		ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва, Подразделение",
			Расшифровка.ФизическоеЛицо, Расшифровка.ПозицияКадровогоРезерва, Расшифровка.Подразделение);
		ОткрытьФорму("Документ.ВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	ИначеЕсли Расшифровка.Действие = "ВключитьВКандидаты" Тогда
		ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва, Подразделение",
			Расшифровка.ФизическоеЛицо, Расшифровка.ПозицияКадровогоРезерва, Расшифровка.Подразделение);
		ОткрытьФорму("Документ.ЗаявкаНаВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПрошлыеРезервистыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка,
	ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Действие = "ОткрытьКарточкуСотрудника" Тогда
		ОткрытьКарточкуРезервиста(Расшифровка.ФизическоеЛицо);
	ИначеЕсли Расшифровка.Действие = "СоздатьПозициюКадровогоРезерва" Тогда
		ОткрытьФорму("Справочник.КадровыйРезерв.ФормаОбъекта", Новый Структура("ПозицияШтатногоРасписания",
			Расшифровка.ПозицияШтатногоРасписания));
	ИначеЕсли Расшифровка.Действие = "ПричинаИсключения" Тогда
		Если ЗначениеЗаполнено(Расшифровка.ДокументыСсылка) Тогда
			ПоказатьЗначение( , Расшифровка.ДокументыСсылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоКлючевыеДолжностиПриИзменении(Элемент)
	
	Если  ПоказыватьТолькоКлючевыеДолжности Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлючевыеДолжности,
			"ЭтоКлючеваяДолжность", Истина , , ,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлючевыеДолжности,
			"ЭтоКлючеваяДолжность", , , ,Ложь);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндикаторЕстьРезервПриИзменении(Элемент)
	
	УстановитьОтборыСпискаКлючевыеДолжности();
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндикаторРезервНеНазначенПриИзменении(Элемент)
	
	УстановитьОтборыСпискаКлючевыеДолжности();
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндикаторРезервЗакончилсяПриИзменении(Элемент)
	
	УстановитьОтборыСпискаКлючевыеДолжности();
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_КатегорииГруппыДолжностейПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КатегорияДолжностиПриИзменении(Элемент) 
	
	Если ИспользуетсяКадровыйРезервГосслужащих Тогда
		МодульКадровыйРезервГосслужащихКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КадровыйРезервГосслужащихКлиент");
		МодульКадровыйРезервГосслужащихКлиент.КатегорияДолжностиПриИзменении(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ГруппаДолжностиПриИзменении(Элемент)
	
	Если ИспользуетсяКадровыйРезервГосслужащих Тогда
		МодульКадровыйРезервГосслужащихКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КадровыйРезервГосслужащихКлиент");
		МодульКадровыйРезервГосслужащихКлиент.ГруппаДолжностейПриИзменении(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВидРезерваПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
	Если ИспользуетсяКадровыйРезервГосслужащих Тогда
		МодульКадровыйРезервГосслужащихКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КадровыйРезервГосслужащихКлиент");
		МодульКадровыйРезервГосслужащихКлиент.ВидРезерваПриИзменении(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлючевыеДолжности

&НаКлиенте
Процедура КлючевыеДолжностиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	Элементы.КлючевыеДолжности.Обновить();
	ПодключитьОбработчикОжидания("ВывестиИнформациюОКадровомРезерве", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВывестиИнформациюОКадровомРезерве()
	
	ТекущиеДанные = ТекущиеДанныеСписка();
	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьТабличныеДокументы();
		Возврат;
	КонецЕсли;
	
	Если Не ИспользуетсяКадровыйРезервГосслужащих
		И (Не ТекущиеДанные.Свойство("Должность") Или Не ТекущиеДанные.Свойство("ПозицияШтатногоРасписания")) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗаполнениеКадровогоРезерваДлительнаяОперацияНаСервере(ТекущиеДанные);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьВыводИнформацииОКадровомРезерве", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанныеСписка()
	
	Если ИспользуетсяКадровыйРезервГосслужащих Тогда
		МодульКадровыйРезервГосслужащихКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КадровыйРезервГосслужащихКлиент");
		ТекущиеДанные = МодульКадровыйРезервГосслужащихКлиент.УправлениеКадровымРезервомТекущиеДанныеСписка(ЭтотОбъект);
	Иначе
		ТекущиеДанные = Элементы.КлючевыеДолжности.ТекущиеДанные;
	КонецЕсли;
	
	Возврат ТекущиеДанные;
	
КонецФункции

&НаСервере
Функция ЗаполнениеКадровогоРезерваДлительнаяОперацияНаСервере(ТекущиеДанные)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Если ИспользуетсяКадровыйРезервГосслужащих Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		ДлительнаяОперация = МодульКадровыйРезервГосслужащих.ДлительнаяОперацияЗаполнениеКадровогоРезерва(ЭтотОбъект,
			ПараметрыВыполнения, ТекущиеДанные);
	Иначе
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"Обработки.УправлениеКадровымРезервом.ИнформацияОКадровомРезерве", ТекущиеДанные.Должность,
			ТекущиеДанные.ПозицияШтатногоРасписания, ИспользуютсяЗаявкиНаВключениеВРезерв,
			ИспользуетсяКадровыйРезервПоВидам);
	КонецЕсли;

	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыводИнформацииОКадровомРезерве(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиИнформациюОКадровомРезервеНаСервере(Результат.АдресРезультата, ДополнительныеПараметры);  
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформациюОКадровомРезервеНаСервере(АдресРезультата, ДополнительныеПараметры)
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокументРезервисты = Результат.Резервисты;
	ТабличныйДокументСотрудники = Результат.Сотрудники;
	Если ИспользуютсяЗаявкиНаВключениеВРезерв Тогда
		ТабличныйДокументКандидаты = Результат.Кандидаты;
	КонецЕсли;
	ТабличныйДокументПотенциальныеРезервисты = Результат.ПотенциальныеРезервисты;
	ТабличныйДокументПрошлыеРезервисты = Результат.ПрошлыеРезервисты;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныеДокументы()
	
	ТабличныйДокументРезервисты.Очистить();
	ТабличныйДокументСотрудники.Очистить();
	ТабличныйДокументКандидаты.Очистить();
	ТабличныйДокументПотенциальныеРезервисты.Очистить();
	ТабличныйДокументПрошлыеРезервисты.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательскиеНастройкиОтчетаЭкспертнойОценки(УстанавливаемыйОтбор)
	
	ОтчетОбъект = Отчеты.РезультатыОпросовПоКомпетенциям.Создать();
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(
		ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(УстанавливаемыйОтбор.КлючВарианта).Настройки);
		
	ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОпросПоКомпетенциям",
		УстанавливаемыйОтбор.ОпросПоКомпетенциям);
	
	Для Каждого ЭлементОтбора Из ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическоеЛицо") Тогда
			ЭлементОтбора.ПравоеЗначение = УстанавливаемыйОтбор.ФизическоеЛицо;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборыСпискаКлючевыеДолжности()
	
	МассивИндикаторов = Новый Массив;
	Если ИндикаторЕстьРезерв Тогда
		МассивИндикаторов.Добавить(2);
	КонецЕсли;
	Если ИндикаторРезервНеНазначен Тогда
		МассивИндикаторов.Добавить(3);
	КонецЕсли;
	Если ИндикаторРезервЗакончился Тогда
		МассивИндикаторов.Добавить(1);
	КонецЕсли;
	
	Если МассивИндикаторов.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			КлючевыеДолжности, "КартинкаВида", МассивИндикаторов, , , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			КлючевыеДолжности, "КартинкаВида", МассивИндикаторов, , ,Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоставитьРейтингНаСервере(ПозицияРезерва, ФизическоеЛицо, Рейтинг)
	КадровыйРезерв.ПоставитьРейтинг(ПозицияРезерва, ФизическоеЛицо, Рейтинг);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуРезервиста(Резервист)
	
	Если ЗначениеЗаполнено(Резервист) Тогда
		ПоказатьЗначение(, Резервист);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДинамическихСписков()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКлючевыеДолжности", "Видимость",
		Не ИспользуетсяКадровыйРезервГосслужащих);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКатегорииГруппыДолжностей", "Видимость",
		ИспользуетсяКадровыйРезервГосслужащих);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраниц()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаКандидаты", "Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВключениеВКадровыйРезерв"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПотенциальныеРезервисты",
		"Видимость", ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСотрудники", "Видимость",
		Не ИспользуетсяКадровыйРезервГосслужащих);
	
КонецПроцедуры

#КонецОбласти
